---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MassingIntegrationLevel
source: html/79406a1a-6ee0-9d2d-e12b-e43436dacc3e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MassingIntegrationLevel Property

"Constrain to Massing"

## Syntax (C#)
```csharp
public static ForgeTypeId MassingIntegrationLevel { get; }
```